### 리스트(list)

In [2]:
myfood = ['banana', 'apple', 'candy']
print(myfood[0])
print(myfood[1])
print(myfood[2])
print(myfood[1:3])  # 첫번째 두번째 가져오기

banana
apple
candy
['apple', 'candy']

In [3]:
for item in myfood:
  print(item)

banana
apple
candy

### 딕셔너리(Dictionary)

In [4]:
dict1 = {'one':'하나', 'two':"둘", 'three':'셋'}
dict2 = {1:"하나", 2:"둘", 3:"셋"}
dict3 = {'col1':[1,2,3], 'col2':['a','b','c']}

In [5]:
print(dict1['one'])
print(dict2[2])
print(dict3['col2'])

하나
둘
['a', 'b', 'c']

In [6]:
import pandas as pd
import seaborn as sns

from pandas import Series, DataFrame

In [7]:
print("pandas 버전 : ", pd.__version__)

pandas 버전 :  1.1.3

In [8]:
score = Series( [1000, 14000, 3000, 3000, 1000])
print(score)
print("자료형 확인: ", type(score))

0     1000
1    14000
2     3000
3     3000
4     1000
dtype: int64
자료형 확인:  <class 'pandas.core.series.Series'>

In [9]:
## Series 인덱스 확인
print(score.index) 
# 인덱스를 리스트 자료형으로 변경 후, 확인하기
print(list(score.index))   
## Series 값 확인
print(score.values) 
## Series 값 자료형 확인
print(score.dtype)

RangeIndex(start=0, stop=5, step=1)
[0, 1, 2, 3, 4]
[ 1000 14000  3000  3000  1000]
int64

In [10]:
### 인덱스(index) 속성 이용 
score = Series( [1000, 14000, 3000], 
               index = ['2019-05-01', '2019-05-02', '2019-05-03'] )  
print(score)

2019-05-01     1000
2019-05-02    14000
2019-05-03     3000
dtype: int64

In [11]:
print(type( score['2019-05-01']))
print(score['2019-05-01']) # 인덱스 이용 - 5월 1일 날짜 점수 확인

<class 'numpy.int64'>
1000

In [12]:
print(type(score['2019-05-02':'2019-05-03']))
print(score['2019-05-02':'2019-05-03']) # 5월 2일, 3일 날짜 팀 점수 확인

<class 'pandas.core.series.Series'>
2019-05-02    14000
2019-05-03     3000
dtype: int64

In [13]:
for idx in score.index:
    print(idx)

2019-05-01
2019-05-02
2019-05-03

In [14]:
for value in score.values:
    print(value)

1000
14000
3000

In [15]:
plan = Series( ['공부', '운동', '게임', '영화', '음악', '책', '공부'],
             index = ['2021-06-25','2021-06-26','2021-06-27','2021-06-28','2021-06-29','2021-06-30','2021-07-01'])
plan

2021-06-25    공부
2021-06-26    운동
2021-06-27    게임
2021-06-28    영화
2021-06-29    음악
2021-06-30     책
2021-07-01    공부
dtype: object

In [16]:
idx = pd.date_range(start="2021-06-25", end="2021-07-01")
idx

DatetimeIndex(['2021-06-25', '2021-06-26', '2021-06-27', '2021-06-28',
               '2021-06-29', '2021-06-30', '2021-07-01'],
              dtype='datetime64[ns]', freq='D')

In [17]:
val = ['공부', '운동', '게임', '영화', '음악', '책', '공부']
schedule = Series( val, index = idx)
schedule

2021-06-25    공부
2021-06-26    운동
2021-06-27    게임
2021-06-28    영화
2021-06-29    음악
2021-06-30     책
2021-07-01    공부
Freq: D, dtype: object

### 값 하나에 접근
 * 해당되는 index의 값으로 접근이 가능하다.

In [18]:
print(schedule['2021-06-25'])

공부

### 값 하나가 아닌 여러개에 접근(slicing)
 * Series 값으로 반환된다.

In [19]:
print(schedule['2021-06-25':'2021-06-28'])

2021-06-25    공부
2021-06-26    운동
2021-06-27    게임
2021-06-28    영화
Freq: D, dtype: object

In [20]:
schedule[0:3]

2021-06-25    공부
2021-06-26    운동
2021-06-27    게임
Freq: D, dtype: object

### iloc접근

In [21]:
schedule.iloc[0:3]

2021-06-25    공부
2021-06-26    운동
2021-06-27    게임
Freq: D, dtype: object

### loc로 접근

In [22]:
schedule.loc['2021-06-25':'2021-06-27']

2021-06-25    공부
2021-06-26    운동
2021-06-27    게임
Freq: D, dtype: object

### index가져오기

In [23]:
for idx in schedule.index:
    print(idx)

2021-06-25 00:00:00
2021-06-26 00:00:00
2021-06-27 00:00:00
2021-06-28 00:00:00
2021-06-29 00:00:00
2021-06-30 00:00:00
2021-07-01 00:00:00

### 값만 가져오기

In [24]:
for val in schedule.values:
    print(val)

공부
운동
게임
영화
음악
책
공부

### 배열 전체 가져오기

In [25]:
schedule.values

array(['공부', '운동', '게임', '영화', '음악', '책', '공부'], dtype=object)

### index만 전체 가져오기

In [26]:
schedule.index

DatetimeIndex(['2021-06-25', '2021-06-26', '2021-06-27', '2021-06-28',
               '2021-06-29', '2021-06-30', '2021-07-01'],
              dtype='datetime64[ns]', freq='D')

## 03 데이터 프레임의 이해
 * 데이터 프레임의 객체를 생성하는 가장 간단한 방법은 딕셔너리를 이용하는 방법
 * 데이터 프레임은 Series의 결합으로 이루어진 것으로 생각할 수 있음.
 * Pandas(판다스)의 대표적인 기본 자료형이다.
 * DataFrame 함수를 이용하여 객체 생성이 가능하다.

In [27]:
from pandas import DataFrame

In [28]:
idx = pd.date_range(start='2021-06-21', end='2021-06-24')
idx

DatetimeIndex(['2021-06-21', '2021-06-22', '2021-06-23', '2021-06-24'], dtype='datetime64[ns]', freq='D')

In [29]:
dat = { 'col1' : [1,2,3,4],
        'col2' : [10,20,30,40],
        'col3' : ['A', 'B', 'C', 'D'] }
df = DataFrame(dat, index=idx)
df

            col1  col2 col3
2021-06-21     1    10    A
2021-06-22     2    20    B
2021-06-23     3    30    C
2021-06-24     4    40    D

In [30]:
idx = pd.date_range(start='2021-06-21', end='2021-06-25')
idx

DatetimeIndex(['2021-06-21', '2021-06-22', '2021-06-23', '2021-06-24',
               '2021-06-25'],
              dtype='datetime64[ns]', freq='D')

In [31]:
from pandas import DataFrame
team_score = { "toto":[1500,3000,5000,7000,5500],
              "apple":[4000,5000,6000,5500,4500],
              "gildong":[2000,2500,3000,4000,3000],
              "catanddog":[7000,5000,3000,5000,4000]}
team_df = DataFrame(team_score, index=idx)
team_df

            toto  apple  gildong  catanddog
2021-06-21  1500   4000     2000       7000
2021-06-22  3000   5000     2500       5000
2021-06-23  5000   6000     3000       3000
2021-06-24  7000   5500     4000       5000
2021-06-25  5500   4500     3000       4000

In [32]:
team_df = DataFrame(team_score,
                   columns=['catanddog', 'toto', 'apple', 'gildong'],
                   index=idx)
team_df

            catanddog  toto  apple  gildong
2021-06-21       7000  1500   4000     2000
2021-06-22       5000  3000   5000     2500
2021-06-23       3000  5000   6000     3000
2021-06-24       5000  7000   5500     4000
2021-06-25       4000  5500   4500     3000

In [33]:
team_df['toto']

2021-06-21    1500
2021-06-22    3000
2021-06-23    5000
2021-06-24    7000
2021-06-25    5500
Freq: D, Name: toto, dtype: int64

In [34]:
team_df[ ['toto', 'gildong'] ]

            toto  gildong
2021-06-21  1500     2000
2021-06-22  3000     2500
2021-06-23  5000     3000
2021-06-24  7000     4000
2021-06-25  5500     3000

In [35]:
# 열 인덱스
team_df.columns

Index(['catanddog', 'toto', 'apple', 'gildong'], dtype='object')

In [36]:
# 행 인덱스
team_df.index

DatetimeIndex(['2021-06-21', '2021-06-22', '2021-06-23', '2021-06-24',
               '2021-06-25'],
              dtype='datetime64[ns]', freq='D')

### loc와 iloc를 이용한 접근
 * loc는 데이터 프레임의 컬럼명(인덱스)를 사용하여 데이터 추출한다.
 * iloc는 데이터 프레임의 데이터 순서(번호)를 사용하여 데이터 추출(시작번호 : 0)
 * loc[ 행, 열] 접근이라고 쉽게 생각한다.

In [37]:
team_df.loc[ : , : ]

            catanddog  toto  apple  gildong
2021-06-21       7000  1500   4000     2000
2021-06-22       5000  3000   5000     2500
2021-06-23       3000  5000   6000     3000
2021-06-24       5000  7000   5500     4000
2021-06-25       4000  5500   4500     3000

In [38]:
team_df.loc[ : , 'toto' ]

2021-06-21    1500
2021-06-22    3000
2021-06-23    5000
2021-06-24    7000
2021-06-25    5500
Freq: D, Name: toto, dtype: int64

In [39]:
team_df.loc[ : , 'toto':'apple']

            toto  apple
2021-06-21  1500   4000
2021-06-22  3000   5000
2021-06-23  5000   6000
2021-06-24  7000   5500
2021-06-25  5500   4500

In [40]:
team_df.loc[ : , 'toto': ]

            toto  apple  gildong
2021-06-21  1500   4000     2000
2021-06-22  3000   5000     2500
2021-06-23  5000   6000     3000
2021-06-24  7000   5500     4000
2021-06-25  5500   4500     3000

In [41]:
team_df.loc[ : , : 'apple']

            catanddog  toto  apple
2021-06-21       7000  1500   4000
2021-06-22       5000  3000   5000
2021-06-23       3000  5000   6000
2021-06-24       5000  7000   5500
2021-06-25       4000  5500   4500

In [42]:
team_df.loc['2021-06-21' , : ]

catanddog    7000
toto         1500
apple        4000
gildong      2000
Name: 2021-06-21 00:00:00, dtype: int64

In [43]:
type(team_df.loc['2021-06-21' , : ])

pandas.core.series.Series

In [44]:
team_df.loc['2021-06-21':'2021-06-23' , : ]

            catanddog  toto  apple  gildong
2021-06-21       7000  1500   4000     2000
2021-06-22       5000  3000   5000     2500
2021-06-23       3000  5000   6000     3000

In [45]:
team_df.iloc[ : , : ]

            catanddog  toto  apple  gildong
2021-06-21       7000  1500   4000     2000
2021-06-22       5000  3000   5000     2500
2021-06-23       3000  5000   6000     3000
2021-06-24       5000  7000   5500     4000
2021-06-25       4000  5500   4500     3000

In [46]:
team_df.iloc[ : , 2 ]

2021-06-21    4000
2021-06-22    5000
2021-06-23    6000
2021-06-24    5500
2021-06-25    4500
Freq: D, Name: apple, dtype: int64

In [47]:
team_df.iloc[ : , 2:4 ]

            apple  gildong
2021-06-21   4000     2000
2021-06-22   5000     2500
2021-06-23   6000     3000
2021-06-24   5500     4000
2021-06-25   4500     3000

In [48]:
team_df.iloc[ : , 2: ]

            apple  gildong
2021-06-21   4000     2000
2021-06-22   5000     2500
2021-06-23   6000     3000
2021-06-24   5500     4000
2021-06-25   4500     3000

In [49]:
team_df.iloc[ : , 0:3 ]

            catanddog  toto  apple
2021-06-21       7000  1500   4000
2021-06-22       5000  3000   5000
2021-06-23       3000  5000   6000
2021-06-24       5000  7000   5500
2021-06-25       4000  5500   4500

In [50]:
team_df.iloc[ 0 , : ]

catanddog    7000
toto         1500
apple        4000
gildong      2000
Name: 2021-06-21 00:00:00, dtype: int64

In [51]:
team_df.iloc[ :3 , : ]

            catanddog  toto  apple  gildong
2021-06-21       7000  1500   4000     2000
2021-06-22       5000  3000   5000     2500
2021-06-23       3000  5000   6000     3000

In [52]:
team_df

            catanddog  toto  apple  gildong
2021-06-21       7000  1500   4000     2000
2021-06-22       5000  3000   5000     2500
2021-06-23       3000  5000   6000     3000
2021-06-24       5000  7000   5500     4000
2021-06-25       4000  5500   4500     3000

In [53]:
team_df['toto']

2021-06-21    1500
2021-06-22    3000
2021-06-23    5000
2021-06-24    7000
2021-06-25    5500
Freq: D, Name: toto, dtype: int64

In [54]:
team_df[['toto','apple']]

            toto  apple
2021-06-21  1500   4000
2021-06-22  3000   5000
2021-06-23  5000   6000
2021-06-24  7000   5500
2021-06-25  5500   4500

In [55]:
print(team_df.loc[ '2021-06-22' ] ) # 2021-06-22 일
print("-----------"*4)
print(team_df.loc[ ['2021-06-22', '2021-06-23'] ]) # 2021-06-22일, 2021-06-23일
print("-----------"*4)
print(team_df.loc[ '2021-06-22': ]) # 2021-06-22일 이후 전체 데이터 가져오기

catanddog    5000
toto         3000
apple        5000
gildong      2500
Name: 2021-06-22 00:00:00, dtype: int64
--------------------------------------------
            catanddog  toto  apple  gildong
2021-06-22       5000  3000   5000     2500
2021-06-23       3000  5000   6000     3000
--------------------------------------------
            catanddog  toto  apple  gildong
2021-06-22       5000  3000   5000     2500
2021-06-23       3000  5000   6000     3000
2021-06-24       5000  7000   5500     4000
2021-06-25       4000  5500   4500     3000

### iloc, loc
 * [:,:]
 * loc[행인덱스]
 * iloc[행의 번호 0부터 시작]

### 값 선택
 * 객체명[열이름]:한개의 열이 선택
 * 객체명[[열1, 열2]]:두개 이상의 열이 선택

### loc를 이용한 열에 접근

In [56]:
## 컬럼명 확인
print(team_df.columns)
print("-----------"*4)
print(team_df.loc[:, 'toto']) # 전체행, toto팀
print("-----------"*4)
print(team_df.loc[:, ['toto', 'gildong'] ]) # 전체행, toto, gildong팀
print("-----------"*4)
print(team_df.loc[:, 'toto': ]) # 전체행, toto 부터 끝까지

Index(['catanddog', 'toto', 'apple', 'gildong'], dtype='object')
--------------------------------------------
2021-06-21    1500
2021-06-22    3000
2021-06-23    5000
2021-06-24    7000
2021-06-25    5500
Freq: D, Name: toto, dtype: int64
--------------------------------------------
            toto  gildong
2021-06-21  1500     2000
2021-06-22  3000     2500
2021-06-23  5000     3000
2021-06-24  7000     4000
2021-06-25  5500     3000
--------------------------------------------
            toto  apple  gildong
2021-06-21  1500   4000     2000
2021-06-22  3000   5000     2500
2021-06-23  5000   6000     3000
2021-06-24  7000   5500     4000
2021-06-25  5500   4500     3000

### iloc 속성을 이용한 행, 열 데이터 접근하기

In [57]:
print(team_df.iloc[0]) # 첫번째 행 접근
print("-----------"*4)
print(team_df.iloc[ [0,1] ]) # 첫번째 두번째 행 접근
print("-----------"*4)
print(team_df.iloc[ 0:3:1] ) # 첫번째부터 세번째 행 접근
print("-----------"*4)
range_num = list(range(0,3,1))
print(team_df.iloc[ range_num ] ) # 첫번째부터 세번째 행 접근

catanddog    7000
toto         1500
apple        4000
gildong      2000
Name: 2021-06-21 00:00:00, dtype: int64
--------------------------------------------
            catanddog  toto  apple  gildong
2021-06-21       7000  1500   4000     2000
2021-06-22       5000  3000   5000     2500
--------------------------------------------
            catanddog  toto  apple  gildong
2021-06-21       7000  1500   4000     2000
2021-06-22       5000  3000   5000     2500
2021-06-23       3000  5000   6000     3000
--------------------------------------------
            catanddog  toto  apple  gildong
2021-06-21       7000  1500   4000     2000
2021-06-22       5000  3000   5000     2500
2021-06-23       3000  5000   6000     3000

In [58]:
print(team_df.iloc[:, 0]) # 첫번째 열 접근
print("-----------"*4)
print(team_df.iloc[:, [0,1] ]) # 첫번째 두번째 열 접근
print("-----------"*4)
print(team_df.iloc[:, 0:3:1] ) # 첫번째부터 세번째 열 접근
print("-----------"*4)
range_num = list(range(0,3,1))
print(team_df.iloc[:, range_num ] ) # 첫번째부터 세번째 열 접근

2021-06-21    7000
2021-06-22    5000
2021-06-23    3000
2021-06-24    5000
2021-06-25    4000
Freq: D, Name: catanddog, dtype: int64
--------------------------------------------
            catanddog  toto
2021-06-21       7000  1500
2021-06-22       5000  3000
2021-06-23       3000  5000
2021-06-24       5000  7000
2021-06-25       4000  5500
--------------------------------------------
            catanddog  toto  apple
2021-06-21       7000  1500   4000
2021-06-22       5000  3000   5000
2021-06-23       3000  5000   6000
2021-06-24       5000  7000   5500
2021-06-25       4000  5500   4500
--------------------------------------------
            catanddog  toto  apple
2021-06-21       7000  1500   4000
2021-06-22       5000  3000   5000
2021-06-23       3000  5000   6000
2021-06-24       5000  7000   5500
2021-06-25       4000  5500   4500

### iloc, loc
 * [:,:]
 * loc[행인덱스]
 * iloc[행의 번호 0부터 시작]

### 값 선택
 * 객체명[열이름]:한개의 열이 선택
 * 객체명[[열1, 열2]]:두개 이상의 열이 선택

In [59]:
print(team_df.sum() )  # 열의 합계 axis=0
print("----")
print(team_df.mean() )  # 열의 평균
print("----")

catanddog    24000
toto         22000
apple        25000
gildong      14500
dtype: int64
----
catanddog    4800.0
toto         4400.0
apple        5000.0
gildong      2900.0
dtype: float64
----

In [61]:
print(team_df.sum(axis=1) )  # 행의 합계
print("----")
print(team_df.mean(axis=1) )   # 행의 평균
print("----")

2021-06-21    14500
2021-06-22    15500
2021-06-23    17000
2021-06-24    21500
2021-06-25    17000
Freq: D, dtype: int64
----
2021-06-21    3625.0
2021-06-22    3875.0
2021-06-23    4250.0
2021-06-24    5375.0
2021-06-25    4250.0
Freq: D, dtype: float64
----

In [62]:
## 날짜별 누적 통계
team_df.cumsum()

            catanddog   toto  apple  gildong
2021-06-21       7000   1500   4000     2000
2021-06-22      12000   4500   9000     4500
2021-06-23      15000   9500  15000     7500
2021-06-24      20000  16500  20500    11500
2021-06-25      24000  22000  25000    14500

In [63]:
## 날짜별 합계
print(team_df.sum(axis=1))

2021-06-21    14500
2021-06-22    15500
2021-06-23    17000
2021-06-24    21500
2021-06-25    17000
Freq: D, dtype: int64

In [64]:
team_df

            catanddog  toto  apple  gildong
2021-06-21       7000  1500   4000     2000
2021-06-22       5000  3000   5000     2500
2021-06-23       3000  5000   6000     3000
2021-06-24       5000  7000   5500     4000
2021-06-25       4000  5500   4500     3000

In [65]:
team_df['rowsum'] = team_df.sum(axis=1)
team_df

            catanddog  toto  apple  gildong  rowsum
2021-06-21       7000  1500   4000     2000   14500
2021-06-22       5000  3000   5000     2500   15500
2021-06-23       3000  5000   6000     3000   17000
2021-06-24       5000  7000   5500     4000   21500
2021-06-25       4000  5500   4500     3000   17000

In [66]:
team_df['rowsum'].sort_values(ascending=False)

2021-06-24    21500
2021-06-25    17000
2021-06-23    17000
2021-06-22    15500
2021-06-21    14500
Name: rowsum, dtype: int64

### 실습 1-1
 * DataFrame를 하나 만들어보자. 5행, 열2~3개 만들기

In [104]:
import pandas as pd
name = ['솔고바이오','한세엠케이','네오오토','엄지하우스']
price = ['993','9,490','9,990','4,885']
volume = ['4,657,575','19,612,745','3,158,123','7,231']
dat = {"종목":name,"현재가":price,"거래량":volume}
dat

{'종목': ['솔고바이오', '한세엠케이', '네오오토', '엄지하우스'],
 '현재가': ['993', '9,490', '9,990', '4,885'],
 '거래량': ['4,657,575', '19,612,745', '3,158,123', '7,231']}

### 실습 1-2
 * DataFrame을 동일한 데이터로 만들며 index를 날짜로 넣어 보자.

In [105]:
idx = pd.date_range(start='2021-06-24',end='2021-06-27')
dat_df = pd.DataFrame(dat, index=idx)
dat_df

               종목    현재가         거래량
2021-06-24  솔고바이오    993   4,657,575
2021-06-25  한세엠케이  9,490  19,612,745
2021-06-26   네오오토  9,990   3,158,123
2021-06-27  엄지하우스  4,885       7,231

### 실습 1-3 행 선택해 보기 (iloc 이용)
 * 2~3행을 선택해 보자.
 * 4번째 행을 선택해 보자.

In [96]:
print(dat_df.iloc[1:3])

               종목    현재가         거래량
2021-06-25  한세엠케이  9,490  19,612,745
2021-06-26   네오오토  9,990   3,158,123

In [97]:
print(dat_df.iloc[3])

종목     엄지하우스
현재가    4,885
거래량    7,231
Name: 2021-06-27 00:00:00, dtype: object

### 실습 1-4 행 선택해 보기 (loc 이용)
 * 2~3행을 선택해 보자.
 * 4번째 행을 선택해 보자.

In [98]:
print(dat_df.loc[['2021-06-25','2021-06-26']])

               종목    현재가         거래량
2021-06-25  한세엠케이  9,490  19,612,745
2021-06-26   네오오토  9,990   3,158,123

In [99]:
print(dat_df.loc['2021-06-27'])

종목     엄지하우스
현재가    4,885
거래량    7,231
Name: 2021-06-27 00:00:00, dtype: object

### 실습 1-5 행열 선택해 보기 (loc이용)
 * 2행 2열부터 3행 3열까지 선택해 보자.

In [101]:
print(dat_df.loc[['2021-06-25','2021-06-26'],['현재가','거래량']])

              현재가         거래량
2021-06-25  9,490  19,612,745
2021-06-26  9,990   3,158,123

In [ ]:
# 실습 1-1, 1-2
import pandas as pd
idx = pd.date_range(start='2021-06-24',end='2021-06-27')

name = ['솔고바이오','한세엠케이','네오오토','엄지하우스']
price = ['993','9,490','9,990','4,885']
volume = ['4,657,575','19,612,745','3,158,123','7,231']
dat = {"종목":name,"현재가":price,"거래량":volume}
dat_df = pd.DataFrame(dat, index=idx)
dat_df

# 실습 1-3
print(dat_df.iloc[1:3])
print(dat_df.iloc[3])

# 실습 1-4
print(dat_df.loc[['2021-06-25','2021-06-26']])
print(dat_df.loc['2021-06-27'])

# 실습 1-5
print(dat_df.loc[['2021-06-25','2021-06-26'],['현재가','거래량']])